In [2]:
import pandas as pd
import numpy as np
import requests
import time
import json
import prettytable
import matplotlib.pyplot as plt

In [4]:
file_path = 'jobs_age_df.csv'
df = pd.read_csv(file_path)
df

     year period periodName      0      1      2      3      4      5
0    2009    M01    January  18287  30438  32274  33942  20918   6130
1    2009    M02   February  18300  30295  32052  33867  21003   5966
2    2009    M03      March  18067  30170  31726  33773  20945   6055
3    2009    M04      April  18092  30082  31734  33801  21052   6034
4    2009    M05        May  17817  29924  31639  33683  21182   6132
..    ...    ...        ...    ...    ...    ...    ...    ...    ...
115  2018    M08     August  18721  35352  32655  32322  26578   9687
116  2018    M09  September  19130  35511  32501  32320  26709   9933
117  2018    M10    October  19156  35693  32857  32343  26828   9925
118  2018    M11   November  19164  35672  32796  32376  26855  10046
119  2018    M12   December  19111  35689  32881  32263  26910   9951

[120 rows x 9 columns]

In [7]:
job_age_df = df.rename(columns={'0':'16-24 Age Group',
                              '1': '25-34 Age Group',
                              '2': '35-44 Age Group',
                              '3': '45-54 Age Group',
                              '4': '55-64 Age Group',
                              '5': '65 and Over Group'})
job_age_df.head()

,year,period,periodName,16-24 Age Group,25-34 Age Group,35-44 Age Group,45-54 Age Group,55-64 Age Group,65 and Over Group
0,2009,M01,January,18287,30438,32274,33942,20918,6130
1,2009,M02,February,18300,30295,32052,33867,21003,5966
2,2009,M03,March,18067,30170,31726,33773,20945,6055
3,2009,M04,April,18092,30082,31734,33801,21052,6034
4,2009,M05,May,17817,29924,31639,33683,21182,6132

In [8]:
z = [ row['16-24 Age Group'] + row['25-34 Age Group'] + row['35-44 Age Group'] + row['45-54 Age Group'] + row['55-64 Age Group'] + row['65 and Over Group'] for index, row in job_age_df.iterrows() ]
job_age_df['Total Employment'] = z
job_age_df

,year,period,periodName,16-24 Age Group,25-34 Age Group,35-44 Age Group,45-54 Age Group,55-64 Age Group,65 and Over Group,Total Employment
0,2009,M01,January,18287,30438,32274,33942,20918,6130,141989
1,2009,M02,February,18300,30295,32052,33867,21003,5966,141483
2,2009,M03,March,18067,30170,31726,33773,20945,6055,140736
3,2009,M04,April,18092,30082,31734,33801,21052,6034,140795
4,2009,M05,May,17817,29924,31639,33683,21182,6132,140377
...,...,...,...,...,...,...,...,...,...,...
115,2018,M08,August,18721,35352,32655,32322,26578,9687,155315
116,2018,M09,September,19130,35511,32501,32320,26709,9933,156104
117,2018,M10,October,19156,35693,32857,32343,26828,9925,156802
118,2018,M11,November,19164,35672,32796,32376,26855,10046,156909
119,2018,M12,December,19111,35689,32881,32263,26910,9951,156805